"use client";
import React from "react";
import { XMarkIcon } from "@heroicons/react/20/solid";
import {
  Card,
  CardContent,
  CardDescription,
  CardFooter,
  CardHeader,
  CardTitle,
} from "@/components/ui/card";

import { useRouter } from "next/navigation";
type Props = {};

function Page({ }: Props) {
  const router = useRouter();

  const handleback = () => {

    router.push("/dash3");
  };
  return (
    <div>
      
      <header className="bg-slate-50 shadow">
        <div className="mx-auto max-w-7xl px-4 py-6 sm:px-6 lg:px-8">
          <h1 className="text-3xl font-bold tracking-tight">
            ข้อกำหนดและเงื่อนไข
          </h1>
        </div>
      </header>
      <main className="bg-slate-50">
        <div>
          <div className="fixed relative isolate flex items-center gap-x-6 overflow-hidden bg-gray-50 px-6 py-2.5 sm:px-3.5 sm:before:flex-1">
            <div
              aria-hidden="true"
              className="absolute left-[max(-7rem,calc(50%-52rem))] top-1/2 -z-10 -translate-y-1/2 transform-gpu blur-2xl"
            >
              <div
                style={{
                  clipPath:
                    "polygon(74.8% 41.9%, 97.2% 73.2%, 100% 34.9%, 92.5% 0.4%, 87.5% 0%, 75% 28.6%, 58.5% 54.6%, 50.1% 56.8%, 46.9% 44%, 48.3% 17.4%, 24.7% 53.9%, 0% 27.9%, 11.9% 74.2%, 24.9% 54.1%, 68.6% 100%, 74.8% 41.9%)",
                }}
                className="aspect-[577/310] w-[36.0625rem] bg-gradient-to-r from-[#5facff] to-[#54b8fb] opacity-30"
              />
            </div>
            <div
              aria-hidden="true"
              className="absolute left-[max(45rem,calc(50%+8rem))] top-1/2 -z-10 -translate-y-1/2 transform-gpu blur-2xl"
            >
              <div
                style={{
                  clipPath:
                    "polygon(74.8% 41.9%, 97.2% 73.2%, 100% 34.9%, 92.5% 0.4%, 87.5% 0%, 75% 28.6%, 58.5% 54.6%, 50.1% 56.8%, 46.9% 44%, 48.3% 17.4%, 24.7% 53.9%, 0% 27.9%, 11.9% 74.2%, 24.9% 54.1%, 68.6% 100%, 74.8% 41.9%)",
                }}
                className="aspect-[577/310] w-[36.0625rem] bg-gradient-to-r from-[#5facff] to-[#54b8fb] opacity-30"
              />
            </div>
            <div className="flex flex-wrap items-center gap-x-4 gap-y-2 p-6"> {/* เพิ่ม padding */}
              <p className="text-2xl leading-6 text-[#5facff]">
                ท่านยอมรับเงื่อนไขหรือไม่ ?
              </p>
              <a
                href="/register"
                className="flex-none rounded-md bg-[#5facff] px-5 py-2 text-lg font-semibold text-white shadow-sm hover:bg-[#54b8fb] focus-visible:outline focus-visible:outline-2 focus-visible:outline-offset-2 focus-visible:outline-gray-900"
              >
                Register now <span aria-hidden="true">&rarr;</span>
              </a>
            </div>
            <div className="flex flex-1 justify-end">
              <button
                type="button"
                className="-m-3 p-3 focus-visible:outline-offset-[-4px]"
                onClick={handleback}
              >
                <span className="sr-only">Dismiss</span>
                <XMarkIcon aria-hidden="true" className="h-5 w-5 text-gray-900" />
              </button>
            </div>
          </div>
        </div>
        <Card className="mx-7 my-7 py-7 px-7 bg-[#b6e2ff] text-[#144363]">
          <CardHeader>
            <CardDescription className="text-lg  text-justify font-medium  text-* ml">
              Entaneer Mind Friend
              เป็นเครื่องมือประเมินสุขภาพจิตเบื้องต้น
              และคัดกรองความเสี่ยงต่อปัญหาสุขภาพจิต
              มีวัตถุประสงค์เพื่อประเมินสุขภาพจิตเบื้องต้นและคัดกรองความเสี่ยงต่อปัญหาสุขภาพจิต
              รวมถึงเพื่อการติดตามดูแลช่วยเหลือผู้ที่เสี่ยงมีปัญหาสุขภาพจิต
            </CardDescription>
            <CardDescription className="text-lg text-justify font-medium mt-5 text-*">
              นักศึกษาและบุคลากรสามารถประเมินสุขภาพจิตตนเองและเข้าถึงบริการได้อย่างรวดเร็ว
              ซึ่งเป็นการประเมินที่ไม่มีค่าใช้จ่ายใด ๆ โปรดอ่านคำถามโดยละเอียด
              และตอบคำถามให้ครบถ้วน
              ทั้งนี้หากผลการประเมินของท่านพบว่ามีความเสี่ยงต่อปัญหาสุขภาพจิต
              ทางมหาวิทยาลัยจะได้ติดตามดูแลและช่วยเหลือในลำดับต่อไป
            </CardDescription>
            <CardDescription className="text-lg text-justify  font-medium mt-5 text-*">
              ข้อมูลที่รวบรวมไว้จะมีการใช้เพื่อประโยชน์ในการจัดทำฐานข้อมูล
              พัฒนาระบบและกลไกการดูแลนักศึกษาและบุคลากรด้านสุขภาพจิต
              รวมทั้งการติดตามดูแลช่วยเหลือผู้ที่มีความเสี่ยงต่อการเกิดปัญหาสุขภาพจิต
              ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล (PDPP) พ.ศ. 2562
            </CardDescription>
          </CardHeader>
        </Card>

        <div className="text-xl text-center mt-7 font-semibold">
          Personal Data Protection Policy
        </div>
        <div className="text-xl text-center mt-3">
          นโยบายคุ้มครองข้อมูลส่วนบุคคลของมหาวิทยาลัยเชียงใหม่
        </div>
        <div className="text-xl text-center mt-3">
          ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
        </div>
        <div className="px-14 text-lg font-medium mt-7">
          มหาวิทยาลัยเชียงใหม่ หรือ ส่วนงานของมหาวิทยาลัยเชียงใหม่
          (ต่อไปนี้จะเรียกรวมว่า “มหาวิทยาลัยเชียงใหม่”)
          ตระหนักถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคล
          จึงได้จัดทำนโยบายการคุ้มครองข้อมูลส่วนบุคคล (Personal Data Protection
          Policy) ขึ้น
          โดยนโยบายนี้ได้อธิบายถึงวิธีการที่มหาวิทยาลัยเชียงใหม่ปฏิบัติต่อข้อมูลส่วนบุคคล
          เช่น การเก็บรวบรวม การจัดเก็บรักษา การใช้ การเปิดเผย รวมถึงสิทธิต่าง ๆ
          ของเจ้าของข้อมูลส่วนบุคคล เป็นต้น
          เพื่อให้เจ้าของข้อมูลได้รับทราบถึงนโยบายในการคุ้มครองข้อมูลส่วนบุคคลของมหาวิทยาลัยเชียงใหม่
          มหาวิทยาลัยเชียงใหม่จึงประกาศนโยบายฯ ดังต่อไปนี้
        </div>
        <div className="px-14 text-lg font-medium mt-7">
          นโยบายการคุ้มครองข้อมูลส่วนบุคคลของมหาวิทยาลัยเชียงใหม่นี้อยู่ภายใต้พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
          พ.ศ. 2562
          โดยมหาวิทยาลัยเชียงใหม่มีอำนาจหน้าที่ตัดสินใจเกี่ยวกับการรวบรวมข้อมูล
          ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล ซึ่งตามกฎหมายเรียกว่า
          “ผู้ควบคุมข้อมูลส่วนบุคคล”
        </div>
        <div className="px-14 text-lg mt-7 font-semibold">1. คำนิยาม</div>
        <div className="px-14 text-lg font-medium ">
          “ข้อมูลส่วนบุคคล” หมายถึง
          ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม
          แต่ไม่รวมถึงข้อมูลผู้ถึงแก่กรรมโดยเฉพาะ “ข้อมูลส่วนบุคคลอ่อนไหว”
          หมายถึง ข้อมูลที่เป็นเรื่องส่วนบุคคลโดยแท้ของบุคคล
          แต่มีความละเอียดอ่อนและอาจสุ่มเสี่ยงในการเลือกปฏิบัติอย่างไม่เป็นธรรม
          เช่น เชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมือง ความเชื่อในลัทธิ
          ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม ข้อมูลสุขภาพ ความพิการ
          ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม ข้อมูลชีวภาพ หรือข้อมูลอื่นใด
          ซึ่งกระทบต่อเจ้าของข้อมูลส่วนบุคคลในทำนองเดียวกันตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
          พ.ศ. 2562 ประกาศกำหนด
        </div>
        <div className="px-14 text-lg mt-7 font-semibold">
          2. วัตถุประสงค์ในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
        </div>
        <div className="px-14 text-lg font-medium ">
          มหาวิทยาลัยเชียงใหม่จะทำการเก็บรวบรวม ใช้
          หรือเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูล
          เพื่อประโยชน์ในการดำเนินงานของมหาวิทยาลัยเชียงใหม่ เช่น
          การประเมินและคัดกรองสุขภาพจิตเบื้องต้น
          การดำเนินกิจกรรมเพื่อส่งเสริมป้องกันปัญหาสุขภาพจิตของนักศึกษาและบุคลากรมหาวิทยาลัยเชียงใหม่
          การติดต่อประสานงานต่างๆ
          เพื่อประโยชน์ในการพัฒนาระบบและกลไกการดูแลนักศึกษาและบุคลากรด้านสุขภาพจิต
          รวมทั้งการติดตามดูแลช่วยเหลือผู้ที่เสี่ยงมีปัญหาสุขภาพจิต
          หรือเพื่อปรับปรุงคุณภาพการทำงานให้มีประสิทธิภาพมากยิ่งขึ้น เช่น
          การจัดทำฐานข้อมูล
          วิเคราะห์และพัฒนากระบวนการดำเนินงานของมหาวิทยาลัยเชียงใหม่
          และเพื่อวัตถุประสงค์อื่นใดที่ไม่ต้องห้ามตามกฎหมาย
          และ/หรือเพื่อปฏิบัติตามกฎหมายหรือกฎระเบียบที่เกี่ยวข้องต่อการดำเนินงานของมหาวิทยาลัยเชียงใหม่
          โดยมหาวิทยาลัยเชียงใหม่จะจัดเก็บและใช้ข้อมูลดังกล่าวตามระยะเวลาเท่าที่จำเป็นตามวัตถุประสงค์ที่ได้แจ้งเจ้าของข้อมูลหรือตามที่กฎหมายกำหนดไว้เท่านั้น
          หากภายหลังมีการเปลี่ยนแปลงวัตถุประสงค์
          มหาวิทยาลัยจะแจ้งให้เจ้าของข้อมูลทราบ
          เพื่อขอความยินยอมและจัดให้มีบันทึกแก้ไขเพิ่มเติมไว้เป็นหลักฐาน ทั้งนี้
          มหาวิทยาลัยเชียงใหม่จะไม่กระทำการเก็บรวบรวม ใช้
          หรือเปิดเผยข้อมูลส่วนบุคคล
          เพื่อประโยชน์อย่างอื่นที่นอกเหนือจากวัตถุประสงค์ที่ได้แจ้งไว้กับเจ้าของข้อมูล
          เว้นแต่
        </div>
        <div className="px-14 text-lg font-medium mt-3 ">
          (1) ได้แจ้งวัตถุประสงค์ใหม่ให้แก่เจ้าของข้อมูลทราบ
          และได้รับความยินยอมจากเจ้าของข้อมูล
        </div>
        <div className="px-14 text-lg font-medium mt-3">
          (2) เป็นการปฏิบัติตามพระราชบัญญัติข้อมูลส่วนบุคคล
          หรือกฎหมายอื่นที่เกี่ยวข้อง
        </div>
        <div className="px-14 text-lg mt-7 font-semibold">
          3. การเก็บรวบรวมข้อมูลส่วนบุคคล
        </div>
        <div className="px-14 text-lg font-medium ">
          มหาวิทยาลัยเชียงใหม่จะทำการเก็บรวบรวมข้อมูลส่วนบุคคลโดยมีวัตถุประสงค์
          ขอบเขต และใช้วิธีการที่ชอบด้วยกฎหมายและเป็นธรรม
          โดยในการเก็บรวบรวมนั้นจะทำเพียงเท่าที่จำเป็นแก่การดำเนินงาน
          ภายใต้วัตถุประสงค์ของมหาวิทยาลัยที่ได้แจ้งไว้ใน ข้อ 2 ทั้งนี้
          มหาวิทยาลัยเชียงใหม่จะดำเนินการให้เจ้าของข้อมูล รับรู้
          ให้ความยินยอมทางอิเล็กทรอนิกส์
          หรือตามแบบวิธีการของมหาวิทยาลัยเชียงใหม่
          กรณีที่มหาวิทยาลัยเชียงใหม่จัดเก็บข้อมูลส่วนบุคคลอ่อนไหวของเจ้าของข้อมูล
          มหาวิทยาลัยเชียงใหม่จะขอความยินยอมจากเจ้าของข้อมูลโดยชัดแจ้งก่อนทำการเก็บรวบรวม
          เว้นแต่กรณีที่กฎหมายให้อำนาจไว้ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
          พ.ศ. 2562
          มหาวิทยาลัยจะไม่เก็บรวบรวมข้อมูลของเจ้าของข้อมูลจากแหล่งที่มาอื่นที่ไม่ใช่จากเจ้าของข้อมูลโดยตรง
          เว้นแต่กรณีที่มหาวิทยาลัยได้แจ้งเจ้าของข้อมูลถึงการเก็บรวบรวมข้อมูลจากแหล่งที่มาอื่น
          ภายใน 30 วัน และได้รับความยินยอมจากเจ้าของข้อมูลแล้ว
          หรือเป็นการเก็บรวบรวมข้อมูลที่ได้รับการยกเว้นไม่ต้องขอความยินยอมตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
          พ.ศ. 2562
        </div>
        <div className="px-14 text-lg mt-7 font-semibold">
          4. การใช้หรือเปิดเผยข้อมูลส่วนบุคคล
        </div>
        <div className="px-14 text-lg font-medium ">
          มหาวิทยาลัยเชียงใหม่จะไม่ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูลไปให้บุคคลใดโดยปราศจากความยินยอม
          และจะใช้หรือเปิดเผยตามวัตถุประสงค์ที่ได้มีการแจ้งไว้ อย่างไรก็ดี
          เพื่อให้เป็นประโยชน์ต่อการดำเนินงานของมหาวิทยาลัยเชียงใหม่และการให้บริการแก่เจ้าของข้อมูล
          มหาวิทยาลัยเชียงใหม่อาจมีความจำเป็นในการเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูลให้แก่หน่วยงานในสังกัดมหาวิทยาลัยเชียงใหม่
          หรือบุคคลอื่นทั้งในและต่างประเทศ เช่น สถานพยาบาลผู้ให้บริการต่าง ๆ
          ที่ต้องดำเนินงานที่เกี่ยวข้องกับข้อมูลส่วนบุคคล
          โดยในการเปิดเผยข้อมูลส่วนบุคคลให้แก่บุคคลดังกล่าว
          มหาวิทยาลัยเชียงใหม่จะดำเนินการให้บุคคลเหล่านั้นเก็บรักษาข้อมูลส่วนบุคคลไว้เป็นความลับ
          และไม่นำไปใช้เพื่อวัตถุประสงค์อื่นนอกเหนือจากขอบเขตที่มหาวิทยาลัยเชียงใหม่ได้กำหนดไว้
          นอกจากนี้
          มหาวิทยาลัยเชียงใหม่อาจเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูล
          ภายใต้หลักเกณฑ์ที่กฎหมายกำหนด เช่น การเปิดเผยข้อมูลต่อหน่วยงานราชการ
          หน่วยงานภาครัฐ หน่วยงานกำกับดูแล
          รวมถึงในกรณีที่มีการร้องขอให้เปิดเผยข้อมูลโดยอาศัยอำนาจตามกฎหมาย เช่น
          การร้องขอข้อมูลเพื่อการฟ้องร้องหรือดำเนินคดีตามกฎหมาย
          หรือการร้องขอจากหน่วยงานเอกชน หรือบุคคลภายนอกอื่น ๆ
          ที่มีความเกี่ยวข้องกับกระบวนการทางกฎหมาย
        </div>
        <div className="px-14 text-lg mt-7 font-semibold">
          5. แนวทางในการดำเนินการคุ้มครองข้อมูลส่วนบุคคล
        </div>
        <div className="px-14 text-lg font-medium ">
          มหาวิทยาลัยเชียงใหม่จะกำหนดมาตรการต่าง ๆ
          รวมถึงมาตรการด้านการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลที่สอดคล้องกับกฎหมาย
          ระเบียบ หลักเกณฑ์
          และแนวปฏิบัติด้านการคุ้มครองข้อมูลส่วนบุคคลให้แก่เจ้าหน้าที่สังกัดของมหาวิทยาลัยเชียงใหม่และบุคคลอื่นที่เกี่ยวข้อง
          รวมถึงสนับสนุนและส่งเสริมให้พนักงานมีความรู้และตระหนักถึงหน้าที่และความรับผิดชอบในการเก็บรวบรวม
          การจัดเก็บรักษา การใช้ และการเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูล
          โดยเจ้าหน้าที่สังกัดของมหาวิทยาลัยเชียงใหม่ต้องปฏิบัติตามนโยบายฯ
          และแนวปฏิบัติการคุ้มครองข้อมูลส่วนบุคคลตามที่มหาวิทยาลัยเชียงใหม่กำหนดไว้
          เพื่อให้มหาวิทยาลัยเชียงใหม่สามารถปฏิบัติตามนโยบายและกฎหมายคุ้มครองข้อมูลส่วนบุคคลได้อย่างถูกต้องและมีประสิทธิภาพ
        </div>
        <div className="px-14 text-lg mt-7 font-semibold">
          6. สิทธิของเจ้าของข้อมูลส่วนบุคคล
        </div>
        <div className="px-14 text-lg font-medium ">
          เจ้าของข้อมูลส่วนบุคคลมีสิทธิในการดำเนินการ ดังต่อไปนี้
        </div>
        <div className="px-14 text-lg font-medium ">
          6.1
          สิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลที่ได้ให้ความยินยอมไว้
          ทั้งนี้ การเพิกถอนความยินยอมย่อมไม่ส่งผลกระทบต่อการเก็บรวบรวม ใช้
          หรือเปิดเผยข้อมูลส่วนบุคคลที่ได้ให้ความยินยอมไว้แล้ว
        </div>
        <div className="px-14 text-lg font-medium ">
          6.2 สิทธิในการเข้าถึงข้อมูลส่วนบุคคลและขอทำสำเนาข้อมูลส่วนบุคคล
          รวมถึงการขอให้เปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคลที่ไม่ได้ให้ความยินยอม
        </div>
        <div className="px-14 text-lg font-medium ">
          6.3 สิทธิในการแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง
          เจ้าของข้อมูลมีสิทธิแก้ไขข้อมูลของตนให้ถูกต้อง เป็นปัจจุบัน
          และไม่ก่อให้เกิดการเข้าใจผิด
        </div>
        <div className="px-14 text-lg font-medium ">
          6.4 สิทธิในการลบหรือทำลายข้อมูลส่วนบุคคล
          เจ้าของข้อมูลมีสิทธิขอลบหรือทำลายข้อมูลส่วนบุคคลของตน
          หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของได้
        </div>
        <div className="px-14 text-lg font-medium ">
          6.5 สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล
        </div>
        <div className="px-14 text-lg font-medium ">
          6.6 สิทธิในการให้โอนย้ายข้อมูลส่วนบุคคล
        </div>
        <div className="px-14 text-lg font-medium ">
          6.7 สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล
          เจ้าของข้อมูลสามารถขอใช้สิทธิคัดค้านการเก็บรวบรวม ใช้
          หรือเปิดเผยข้อมูลส่วนบุคคลได้
          โดยยื่นคำร้องขอใช้สิทธิต่อมหาวิทยาลัยเชียงใหม่เป็นลายลักษณ์อักษรหรือผ่านทางจดหมายอิเล็กทรอนิกส์ตามแบบฟอร์มที่มหาวิทยาลัยเชียงใหม่กำหนด
          ผ่าน “ช่องทางการติดต่อของมหาวิทยาลัยเชียงใหม่” ด้านล่าง
          โดยมหาวิทยาลัยเชียงใหม่จะพิจารณาและแจ้งผลการพิจารณาตามคำร้องฯ
          ของเจ้าของข้อมูล ภายใน 30 วัน นับแต่วันที่ได้รับคำร้องฯ ดังกล่าว
          ทั้งนี้
          มหาวิทยาลัยเชียงใหม่อาจปฏิเสธสิทธิของเจ้าของข้อมูลได้ในกรณีที่มีกฎหมายกำหนดไว้
        </div>
        <div className="px-14 text-lg mt-7 font-semibold">
          7. การทบทวนและเปลี่ยนแปลงนโยบายการคุ้มครองข้อมูลส่วนบุคคล
        </div>
        <div className="px-14 text-lg font-medium ">
          มหาวิทยาลัยเชียงใหม่อาจทำการปรับปรุงหรือแก้ไขนโยบายนี้เป็นครั้งคราวเพื่อให้สอดคล้องกับข้อกำหนดตามกฎหมาย
          การเปลี่ยนแปลงการดำเนินงานของมหาวิทยาลัยเชียงใหม่
          รวมถึงข้อเสนอแนะและความคิดเห็นจากหน่วยงานต่าง ๆ
          โดยมหาวิทยาลัยเชียงใหม่จะประกาศแจ้งการเปลี่ยนแปลงให้ทราบอย่างชัดเจน
          ก่อนจะเริ่มดำเนินการเปลี่ยนแปลง
        </div>
        <div className="px-14 text-lg mt-7 font-semibold">
          8. ช่องทางการติดต่อ
        </div>
        <div className="px-14 text-lg font-medium ">
          8.1 คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเชียงใหม่, Chiang Mai, Thailand,
          Chiang Mai
        </div>
        <div className="px-14 text-lg font-medium mb-7">
          8.2 Entaneer Mind Friend - คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเชียงใหม่
          เบอร์โทรศัพท์ : 053 944 179
        </div>
      </main>
    </div>
  );
}

export default Page;
